app/views/customers/_form.html.erb

    <%= form.label :plan_id %>
    <%= form.collection_select :plan_id, Plan.all, :id, :name, {}, {} %>
---
SELECT "plans".* FROM "plans"