app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]